# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

num1 = int(input('Введите первые 3 цифры: '))
num2 = int(input('Введите вторые 3 цифры: '))

sum1 = 0
while num1 > 0:
    sum1 = sum1 + num1 % 10
    num1 = num1 // 10

sum2 = 0
while num2 > 0:
    sum2 = sum2 + num2 % 10
    num2 = num2 // 10

if sum1 == sum2:
    print("У вас счастливый билет!")

else:
    print("У вас не счастливый билет :(")

